$(document).ready(function() {
    $('.button[filter]').click(function(){  //відстежуємо натиск на кнопку із атрибутом filter
        if($(this).attr('filter')=='all') {    //перевіряємо, чи натиснута кнопка є кнопкою ALL, якщо ні - не робимо нічого, якщо так - виконуємо код далі
            if($(this).attr('val')=='off') {   //перевіряємо, чи написнута кнопка (ALL) зараз активна, щоб уникнути повторних натисків
                $('.button[filter]').attr('val', 'off'); //вимикаємо всі кнопки
                $(this).attr('val', 'on'); //вмикаємо цю кнопку (ALL)
                $('.button[filter]').removeClass('focused')//видаляємо класс підсвітки у всіх кнопок
                $(this).addClass('focused');//підсвічуємо активну кнопку
                $('.filter > div').show(300); //показуємо всі картки
            }
        }else //якщо натиснута кнопка не all - виконується цей код
        if($(this).attr('val')== 'off'){    // перевіряємо, чи натиснута кнопка зараз вимкнена, щоб уникнути повторних активацій
            $('.button[filter]').attr('val', 'off');    //вимикаємо всі кнопки
            $(this).attr('val', 'on');  //вмикаємо натиснуту кнопку
            $('.button[filter]').removeClass('focused')//видаляємо класс підсвітки у всіх кнопок
            $(this).addClass('focused');//підсвічуємо активну кнопку
            $('.filter > div').hide(0); //ховаємо всі картки
            var filter = $(this).attr('filter'); //привласнюємо значення фільтру з кнопки змінній, щоб використати в картці
            $('.filter > div[filter='+filter+']').show(300); //показуємо всі картки, в фільтрі якої є значення із натиснутої кнопки
        }   
    })

});